Update dom11diag.md
